def area(a, b): 
    '''
    Возвращает площадь прямоугольника.

        Параметры:
            a (int|float): Длина прямоугольника.
            b (int|float): Ширина прямоугольника.
        
        Возвращает:
            area (int|float): Площадь прямоугольника.
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Возвращает периметр прямоугольника.

        Параметры:
            a (int|float): Длина прямоугольника.
            b (int|float): Ширина прямоугольника.

        Возвращает:
            perimeter (int|float): Периметр прямоугольника.
    '''
    return 2 * (a + b) 
