def area(a, b): 
    '''
    Возвращает площадь прямоугольника.

        Параметры:
            a (float): Длина прямоугольника.
            b (float): Ширина прямоугольника.
        
        Возвращает:
            area (float): Площадь прямоугольника.
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Возвращает периметр прямоугольника.

        Параметры:
            a (float): Длина прямоугольника.
            b (float): Ширина прямоугольника.

        Возвращает:
            perimeter (float): Периметр прямоугольника.
    '''
    return 2 * (a + b) 
