def area(a, h): 
    '''
    Возвращает площадь треугольника.

        Параметры:
            a (int|float): Длина основания треугольника.
            h (int|float): Высота треугольника.
        
        Возвращает:
            area (int|float): Площадь треугольника.
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Возвращает периметр треугольника.

        Параметры:
            a (int|float): Длина первой стороны треугольника.
            b (int|float): Длина второй стороны треугольника.
            c (int|float): Длина третьей стороны треугольника.

        Возвращает:
            perimeter (int|float): Периметр треугольника.
    '''
    return a + b + c 
