def area(a, h): 
    '''
    Возвращает площадь треугольника.

        Параметры:
            a (float): Длина основания треугольника.
            h (float): Высота треугольника.
        
        Возвращает:
            area (float): Площадь треугольника.
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Возвращает периметр треугольника.

        Параметры:
            a (float): Длина первой стороны треугольника.
            b (float): Длина второй стороны треугольника.
            c (float): Длина третьей стороны треугольника.

        Возвращает:
            perimeter (float): Периметр треугольника.
    '''
    return a + b + c 
